In [1]:
import pandas as pd
df=pd.read_csv('../data/titanic_data.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
#average age of the Titanic passengers
avg_age=df['Age'].mean()
avg_age

np.float64(29.69911764705882)

In [7]:
# median age and ticket fare price of the Titanic passengers
median=df[['Age','Fare']].median()
median

Age     28.0000
Fare    14.4542
dtype: float64

In [8]:
# average age for male versus female Titanic passengers
avg_age=df[['Age','Sex']].groupby(by='Sex').mean()
avg_age

              Age
Sex
female  27.915709
male    30.726645

In [11]:
# mean ticket fare price for each of the sex and cabin class combinations
fare_price=df.groupby(by=['Sex', 'Pclass'])['Fare'].mean()
fare_price

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [12]:
# number of passengers in each of the cabin classes
count=df['Pclass'].value_counts()
count

Pclass
3    491
1    216
2    184
Name: count, dtype: int64